app/views/countries/show.html.erb


<% @country.places.each do |p| %></h1>
---
SELECT "places".* FROM "places" WHERE "places"."country_id" = ?  [["country_id", 1]]