app/controllers/places_controller.rb

SELECT "places".* FROM "places" ORDER BY name desc
---
  def index
    @places = Place.all

INSERT INTO "places" ("name", "country_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Melbourne"], ["country_id", 1], ["created_at", "2022-07-09 03:27:31.776103"], ["updated_at", "2022-07-09 03:27:31.776103"]]
---
  def create
    @place = Place.new(place_params)
    if @place.save