app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "dgsdfs"], ["LIMIT", 1]]
---
  def create
#    @user = User.find_by(username: params[:username])
#    return head(:forbidden) unless @user.authenticate(params[:password])
#    session[:user_id] = @user.id

    @user = User.find_by(username: params[:user][:username])