app/controllers/trips_controller.rb

  def index
    @trips = Trip.where(:user_id => current_user.id)
---
SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = ?  [["user_id", 1]]

  def create
    @trip = current_user.trips.new(trip_params)
    if @trip.valid?
      @trip.save!
---
INSERT INTO "trips" ("date", "details", "place_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2022-07-15"], ["details", "asd"], ["place_id", 7], ["user_id", 4], ["created_at", "2022-07-15 12:13:03.551383"], ["updated_at", "2022-07-15 12:13:03.551383"]]

  def edit
    @trip = Trip.find(params[:id])
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]

  def update
    @trip = Trip.find(params[:id])
    if @trip.update!(trip_params)
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "trips" SET "date" = ?, "details" = ?, "updated_at" = ? WHERE "trips"."id" = ?  [["date", "2021-11-11"], ["details", "vjbvjhhjl"], ["updated_at", "2022-07-10 09:32:35.575829"], ["id", 14]]

  def destroy
    Trip.find(params[:id]).destroy
---
DELETE FROM "trips" WHERE "trips"."id" = ?  [["id", 10]]
SELECT "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]