app/controllers/trips_controller.rb

  def update
    @trip = Trip.find(params[:id])
    if @trip.update!(trip_params)
---
UPDATE "trips" SET "updated_at" = ? WHERE "trips"."id" = ?  [["updated_at", "2022-07-15 12:13:31.066683"], ["id", 7]]