app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "peter pan"], ["updated_at", "2022-07-08 06:14:13.190267"], ["id", 3]]
---
  def update
    @user = User.find(params[:id])
    if @user.update!(user_params)