app/models/place.rb

  def country_name=(name)
    self.country = Country.find_or_create_by(name: name)
---
INSERT INTO "countries" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Australia"], ["created_at", "2022-07-09 07:34:50.071078"], ["updated_at", "2022-07-09 07:34:50.071078"]]
SELECT "countries".* FROM "countries" WHERE "countries"."name" = ? LIMIT ?  [["name", "Australia"], ["LIMIT", 1]]