app/models/trip.rb

INSERT INTO "places" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "fsffwd"], ["created_at", "2022-07-10 09:38:42.997381"], ["updated_at", "2022-07-10 09:38:42.997381"]]
SELECT "places".* FROM "places" WHERE "places"."name" = ? LIMIT ?  [["name", "japan"], ["LIMIT", 1]]
---
  def place_name=(name)
    self.place = Place.find_or_create_by(name: name)